# [ 데이터 필터링 ]
    - 원하는 데이터를 추출하기 위해서 사용하는 방법
    - 원하는 데이터를 걸러내겠다는 의미
    - 다양한 조건 검사 진행 => 비교 검사 : ==, !=, >, >=, <, <=

## <hr> (1) 모듈 로딩

In [156]:
import pandas as pd
import numpy as np

## <hr> (2) 데이터 준비

In [157]:
file = '../DATA/employees.csv'

## <hr> (3) 데이터 저장

In [158]:
empDF=pd.read_csv(file)

## <hr> (4) 데이터 확인

In [159]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.1+ KB

In [160]:
empDF.describe()

              Salary
count     999.000000
mean    90655.528529
std     32939.511615
min     35013.000000
25%     62560.000000
50%     90427.000000
75%    118744.500000
max    149908.000000

## <hr> (5) 데이터 필터링

In [161]:
'Happy' == 'Happy', 'Happy' == 'happy'

(True, False)

##### [ 문제 ] 데이터에서 이름이 Maria인 데이터만 추출

In [162]:
print(empDF.columns, empDF.index, sep='\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

#### - bool값으로 구성된 데이터 ==> 불린 인덱싱(Boolean indexing)

In [163]:
empDF['First Name'] == 'Maria'

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [164]:
(empDF['First Name'] == 'Maria').sum()

6

In [165]:
empDF[empDF['First Name'] == 'Maria']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [166]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [167]:
mariaMask=(empDF['First Name'] == 'Maria')

print(type(mariaMask), mariaMask.sum(), sep = '\n\n')

<class 'pandas.core.series.Series'>

6

In [168]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [169]:
##### [ 문제 ] 데이터에서 연봉이 50,000 이상인 데이터만 추출

In [170]:
Sal2 = (empDF["Salary"] >= 100000)
empDF[empDF["Salary"] >= 100000]
empDF[Sal2]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
999     Albert    Male    5/15/12  129949.0   True         Sales

[409 rows x 6 columns]

In [171]:
mask = ((empDF['Gender']== 'Male') & (empDF['Salary'] >= 148000))
type(mask), mask.sum()

(pandas.core.series.Series, 5)

In [172]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

#### - 여러 개의 조건이 모두 True여야만 하는 조건 => AND 조건
    * 문법 : 조건 1 & 조건2 & 조건3 & ... & 조건N
    * 연산자 : & 앰퍼센트
    * 결과 : True/False

#### - 여러 개의 조건 중 1개 이상이 True면 True가 되는 조건 => OR 조건
    * 문법 : 조건 1 | 조건2 | 조건3 | ... | 조건N
    * 연산자 : | 파이프 ==> 키보드 Enter키 위에 있음
    * 결과 : True/False

#### - [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 팀이 없는 사람 데이터 조회

In [173]:
mask1 = (empDF['Start Date'] < '1993-01-01')
mask1

0       False
1       False
2       False
3       False
4        True
        ...
996      True
997     False
998     False
999     False
1000    False
Name: Start Date, Length: 1001, dtype: bool

In [174]:
mask2 = (empDF['Mgmt'] == False)
mask2

0       False
1       False
2        True
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Name: Mgmt, Length: 1001, dtype: bool

In [175]:
mask = mask1 | mask2
empDF[mask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
8       Angela  Female   11/22/05   95570.0   True   Engineering
11       Julie  Female   10/26/97  102508.0   True         Legal
..         ...     ...        ...       ...    ...           ...
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[640 rows x 6 columns]

In [178]:
pd.to_datetime(empDF['Start Date'], format="%d/%m/%y")

0      1993-08-06
1      1996-03-31
2             NaT
3      2005-03-04
4      1998-01-24
          ...
996    1984-01-31
997    2013-05-20
998    2013-04-20
999    2012-05-15
1000          NaT
Name: Start Date, Length: 1001, dtype: datetime64[ns]

In [177]:
empDF['Start Date']=  pd.to_datetime(empDF['Start Date'])
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.1+ KB

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_29360/3941167698.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF['Start Date']=  pd.to_datetime(empDF['Start Date'])

In [179]:
(empDF['Team'] =='Sales') | (empDF['Team'] == 'Legal') | (empDF['Team'] == 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [180]:
empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

#### - 구간 지정 검사 불린 메서드 => DF. between(low, high)

In [182]:
(empDF['Salary']>=80000) & (empDF['Salary']<90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [183]:
empDF['Salary'].between(80000,90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [185]:
empDF['First Name'].str.upper()

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [186]:
# empDF['First Name'].str.replace()도 가능

TypeError: StringMethods.replace() missing 2 required positional arguments: 'pat' and 'repl'